## 데이터를 원하는 대로 선택하기
원본 훼손 없이 원하는 부분만 선택하는 방법

In [1]:
import numpy as np
import pandas as pd

In [21]:
KTX_data = {'경부선 KTX':[39060,39896,42005,43621,41702,41266,32427],
            '호남선 KTX':[7313,6967,6873,6626,8675,10622,9228],
            '경전선 KTX':[3627,4168,4088,4424,4606,4984,5570],
            '전라선 KTX':[309,1771,1954,2244,3146,3945,5766],
            '동해선 KTX':[np.nan,np.nan,np.nan,np.nan,2395,3786,6667]}

df_KTX = pd.DataFrame(KTX_data, index=['2011','2012','2013','2014','2015','2016','2017'])
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [22]:
# DataFrame 데이터의 인덱스 확인하기
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [6]:
# DataFrame 데이터의 컬럼즈 확인하기
df_KTX.columns

Index(['연도', '경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [10]:
# DataFrame 데이터의 값 확인하기
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

### head()와 tail()

데이터를 분석할 때 크기가 큰 데이터는 데이터 전체를 출력하면 너무 많은 데이터가 출력이 돼 오히려 불편한데, 일부만 보면서 분석한 후 코드를 작성하려면 head()와 tail()을 이용하면 된다.
  * `DataFrame_data.head([n])`, `DataFrame_data.tail([n])`
  * 인자 n을 지정하면 n개의 행의 데이터 만큼 반환한다. (기본값은 5)

In [11]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [12]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

### DataFrame_data[행시작위치 : 행끝위치]
* DataFrame 데이터에서 연속된 구간의 행 데이터 선택하기
* 행 시작위치~ 행 끝위치-1까지의 행 데이터를 반환
* 행의 위치는 0부터 시작

In [14]:
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [15]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

### DataFrame_df.loc[index_name]
* index명으로 행을 선택하기
* DataFrame 데이터를 생성할 때 index를 지정했다면 사용가능
* 연속구간으로 선택도 가능 : `DataFrame_df.loc[end_index_name:end_index_name]`

In [23]:
df_KTX.loc['2011']

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [24]:
df_KTX.loc['2013':'2015']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

### DataFrame_df[columns_name]
* 데이터 프레임에서 column_name으로 지정한 열을 선택

In [25]:
df_KTX['호남선 KTX']

2011     7313
2012     6967
2013     6873
2014     6626
2015     8675
2016    10622
2017     9228
Name: 호남선 KTX, dtype: int64

* 여러 개의 열을 추출 : `df[['열이름','열 이름']]`

**DataFrame_df[columns_name][start_index_name:end_index_name]**
**DataFrame_df[columns_name][start_index_pose:end_index_pose]**
* columns_name으로 열 하나를 선택한 후, 인덱스의 이름(위치)를 지정해 인덱스의 범위를 선택할 수 있다
* index의 위치는 0부터 시작, end_index_pose-1까지 선택됨

In [26]:
df_KTX['호남선 KTX']['2013':'2016']

2013     6873
2014     6626
2015     8675
2016    10622
Name: 호남선 KTX, dtype: int64

In [29]:
df_KTX['호남선 KTX'][2:6]

2013     6873
2014     6626
2015     8675
2016    10622
Name: 호남선 KTX, dtype: int64

**데이터 프레임에서 인덱서 사용**
**loc, iloc 속성을 사용하는 인덱싱**
- pandas 패키지는 [행번호,열번호] 인덱싱 불가
- iloc 속성 사용하면 가능
- iloc[행번호,열번호] : 가능
- loc[행제목,열제목] : 가능


- loc 인덱서 (행 우선 인덱서)
- df.loc[행인덱싱 값]   # 행우선 인덱서
- df.loc[행인덱싱 값,열인덱싱 값]

**인덱싱 값**
1. 인덱스 데이터 : (index name, column name)
2. 인덱스 데이터 슬라이스
3. 같은 행 인덱스를 갖는 불리언 시리즈(행 인덱싱인 경우)
    - 조건으로 추출 가능
4. 위 값을 반환하는 함수

### DataFrame 데이터 중 하나의 원소만 선택하기
* df.loc[index_name][column_name]
* df.loc[index_name, column_name]
* df[column_name][index_name]
* df[column_name][index_pos]
* df[column_name].loc[index_name]

In [31]:
df_KTX.loc['2015']['경전선 KTX']

4606.0

In [32]:
df_KTX.loc['2015','경전선 KTX']

4606

In [33]:
df_KTX['경전선 KTX']['2015']

4606

In [34]:
df_KTX['경전선 KTX'][4]

4606

In [36]:
df_KTX['경전선 KTX'].loc['2015']

4606

### 전치 : `DataFrame_data.T`
행과 열을 바꿈

In [37]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [38]:
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

* **df[[열이름, 열이름, ..., 열이름]]**

열의 항목 이름을 지정해 열의 순서를 지정할 수 있음

In [40]:
df_KTX[['동해선 KTX', '호남선 KTX', '경부선 KTX', '전라선 KTX', '경전선 KTX']]

      동해선 KTX  호남선 KTX  경부선 KTX  전라선 KTX  경전선 KTX
2011      NaN     7313    39060      309     3627
2012      NaN     6967    39896     1771     4168
2013      NaN     6873    42005     1954     4088
2014      NaN     6626    43621     2244     4424
2015   2395.0     8675    41702     3146     4606
2016   3786.0    10622    41266     3945     4984
2017   6667.0     9228    32427     5766     5570

## 데이터 통합하기
두 개의 데이터를 하나로 통합

### 1. 세로 방향으로 통합하기
**df1.append(df2 [,ignore_index=True]**
* ignore_index = True를 입력하게 되면 생성된 DataFrame 데이터에는 데이터 순서대로 새로운 index가 할당되고, 입력하지 않으면 생성된 DataFrame 데이터에는 기존 데이터의 index가 그대로 유지됨.

In [41]:
df1 = pd.DataFrame({'Class1':[95,92,98,100],'Class2':[91,93,97,99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [42]:
df2 = pd.DataFrame({'Class1':[87,89],'Class2':[85,90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [43]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [44]:
df1.append(df2, ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

* 열의 개수가 다른 데이터를 추가한다면, 데이터가 없는 부분은 NaN으로 채워짐

In [53]:
df3 = pd.DataFrame({'Class1':[96,89]})
df3

   Class1
0      96
1      89

In [54]:
df1.append(df3, ignore_index=True)

   Class1  Class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    99.0
4      96     NaN
5      89     NaN

### 2. 가로 방향으로 통합하기
**df1.join(df2)**

두 개의 DataFrame 데이터를 가로 방향으로 합치기

In [55]:
df4 = pd.DataFrame({'Class3':[93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [56]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

* index 라벨을 지정한 DataFrame의 데이터의 경우에도 index가 같으면 join()을 이용해 가로 방향으로 데이터를 추가할 수 있음

In [61]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'Class1':[95,92,98,100],'Class2':[91,93,97,99]}, index=index_label)
df4a = pd.DataFrame({'Class3':[93,91,95,98]}, index = index_label)

In [62]:
df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [63]:
df5 = pd.DataFrame({'Class4':[82,92]})
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

### 3. 특정 열을 기준으로 통합하기
`df1.merge(df2)`
* 두 개의 DataFrame 데이터를 특정 열(key)을 기준으로 통합
* 만약 두 개의 데이터에서 공통된 열이 있다면 이 열을 기준으로 좌우로 두 데이터를 통합함

In [64]:
df_ab = pd.DataFrame({'제품A':[100,150,200,130],'제품B':[90,110,140,170],'판매월':['1월','2월','3월','4월']})
df_ab

   제품A  제품B 판매월
0  100   90  1월
1  150  110  2월
2  200  140  3월
3  130  170  4월

In [67]:
df_cd = pd.DataFrame({'제품C':[112,141,203,134],'제품D':[90,110,140,170],'판매월':['1월','2월','3월','4월']})
df_cd

   제품C  제품D 판매월
0  112   90  1월
1  141  110  2월
2  203  140  3월
3  134  170  4월

In [68]:
df_ab.merge(df_cd)

   제품A  제품B 판매월  제품C  제품D
0  100   90  1월  112   90
1  150  110  2월  141  110
2  200  140  3월  203  140
3  130  170  4월  134  170

`df1.merge(df2, how = merge_method, on = key_label)`

* 두 개의 DataFrame 데이터가 특정 열을 기준으로 일부만 공통된 값을 갖는 경우에 통합하기
* how 인자에는 지정된 특정 열을 기준으로 통합 방법을 지정해야 함.
|how 인자|설명|
|-------|----|
|left|왼쪽 데이터는 모두 선택하고 지정된 열에 값이 있는 오른쪽 데이터를 선택|
|right|오른쪽 데이터는 모두 선택하고 지정된 열에 값이 있는 왼쪽 데이터를 선택|
|outer|지정된 열을 기준으로 왼쪽과 오른쪽 데이터 모두 선택|
|inner|지정된 열을 기준으로 왼쪽과 오른쪽 데이터 중 공통된 항목만 선택(기본값)|
* on인자에는 통합하려는 기준이 되는 특정 열의 라벨 이름을 입력
* on인자에 입력하지 않으면 자동으로 두 데이터에서 공통적으로 포함된 열이 선택됨

In [71]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left':[1,2,3]})
df_right = pd.DataFrame({'key':['A','B','D'], 'right':[4,5,6]})

In [72]:
df_left.merge(df_right,how='left')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [73]:
df_left.merge(df_right,how='right')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [74]:
df_left.merge(df_right,how='outer')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [75]:
df_left.merge(df_right,how='inner')

  key  left  right
0   A     1      4
1   B     2      5

## 데이터 파일을 읽고 쓰기
pandas는 표 형식의 데이터 파일을 DataFrame 형식의 데이터로 읽어오기와 DataFrame 형식의 데이터를 표 형식으로 파일로 저장하기를 제공함

### 1. 표 형식의 데이터 파일을 읽기
`df = pd.read_csv(file_name[, encoding='cp949', index_col='열이름', sep='구분자'])`
* 기본적으로 각 데이터 필드가 콤마로 구분된 CSV 파일을 읽음
* 옵션을 지정하면 콤마 외에 다른 구분자로 구분되어 있어도 데이터를 읽어올 수 있음
* 텍스트 파일이 utf_8로 인코딩 되어있으면 encoding='utf_8'로 옵션을 지정하거나 생략 가능, cp949로 인코딩 되어있으면 encoding='cp949'를 추가해야 함
* read_csv()로 텍스트 파일을 읽어오면 index가 자동으로 지정됨
* `index_col='열이름'` : 특정 열을 index로 선택하기
* `usecols = '[column_name, ..., column_name]'` : dataframe에서 사용할 columns 지정

### 2. 표 형식의 데이터를 파일로 쓰기
`df.to_csv(file_name[, sep='', encoding=''])`
* 선택사항인 구분자와 인코딩 방식은 지정하지 않으면 구분자는 콤마, 인코딩 방식은 'uft-8'이 됨
* `df.index.name=문자열` : DataFrame 데이터에서 index에 이름을 추가하기
* `df['column_name']=column_data` : DataFrame 데이터에 새로운 열 추가하기